Repository: Kamisato-Yuna/TableViewer
Catalog: TableViewer/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# …结果已截断。
source: …Results truncated.
zh_hans: …结果已截断。

# …输出已截断，请缩小查询范围。
source: …Output truncated. Narrow your query.
zh_hans: …输出已截断，请缩小查询范围。

# %lld 个字段
source: %lld fields
zh_hans: %lld 个字段

# %lld 条记录
source: %lld records
zh_hans: %lld 条记录

# %lld 行 · %@ ms
source: %lld rows · %@ ms
zh_hans: %lld 行 · %@ ms

# %lld 行受影响。
source: %lld rows affected.
zh_hans: %lld 行受影响。

# <连接 URI>
source: <connection URI>
zh_hans: <连接 URI>

# API 响应过大。
source: API response is too large.
zh_hans: API 响应过大。

# API 地址发生重定向，已停止请求。请直接填写最终 API 地址。
source: The API redirected the request, so it was stopped. Enter the final API URL directly.
zh_hans: API 地址发生重定向，已停止请求。请直接填写最终 API 地址。

# API 地址无效。
source: Invalid API URL.
zh_hans: API 地址无效。

# API 流式响应过大。
source: API stream is too large.
zh_hans: API 流式响应过大。

# API 设置
source: API Settings
zh_hans: API 设置

# API 请求失败。
source: API request failed.
zh_hans: API 请求失败。

# API 返回内容过大。
source: API response is too large.
zh_hans: API 返回内容过大。

# API 返回的工具调用不完整；未执行操作。
source: The API returned incomplete tool calls. No operation was executed.
zh_hans: API 返回的工具调用不完整；未执行操作。

# API 返回错误。
source: The API returned an error.
zh_hans: API 返回错误。

# Agent 助手
source: AI Assistant
zh_hans: Agent 助手

# Agent 操作未完成
source: AI operation failed
zh_hans: Agent 操作未完成

# Agent 正在思考…
source: Thinking…
zh_hans: Agent 正在思考…

# HTTP 不加密 API Key 和对话内容，仅用于你信任的内网。
source: HTTP does not encrypt your API key or conversation. Use it only on a trusted private network.
zh_hans: HTTP 不加密 API Key 和对话内容，仅用于你信任的内网。

# JSON 的第一个字段必须是 MongoDB 命令名。
source: The first JSON field must be a MongoDB command name.
zh_hans: JSON 的第一个字段必须是 MongoDB 命令名。

# JavaScript 执行失败
source: JavaScript execution failed
zh_hans: JavaScript 执行失败

# JavaScriptCore · 写入直接执行
source: JavaScriptCore · Writes execute directly
zh_hans: JavaScriptCore · 写入直接执行

# Key 保存在 macOS 钥匙串。API 地址或模型变更后会清空当前对话，避免将旧内容发给新的服务。
source: Your key is stored in macOS Keychain. Changing the API URL or model clears the conversation to avoid sending previous content to another service.
zh_hans: Key 保存在 macOS 钥匙串。API 地址或模型变更后会清空当前对话，避免将旧内容发给新的服务。

# Mongo Shell 输入
source: Mongo Shell input
zh_hans: Mongo Shell 输入

# MongoDB · JSON 命令
source: MongoDB · JSON Commands
zh_hans: MongoDB · JSON 命令

# MongoDB 写入失败。
source: MongoDB write failed.
zh_hans: MongoDB 写入失败。

# MongoDB 写入确认失败，请刷新检查。
source: MongoDB write acknowledgement failed. Refresh to check the result.
zh_hans: MongoDB 写入确认失败，请刷新检查。

# MongoDB 命令
source: MongoDB Commands
zh_hans: MongoDB 命令

# MongoDB 命令失败
source: MongoDB command failed
zh_hans: MongoDB 命令失败

# MongoDB 操作失败。
source: MongoDB operation failed.
zh_hans: MongoDB 操作失败。

# MongoDB 文档
source: MongoDB Document
zh_hans: MongoDB 文档

# MongoDB 未连接。
source: MongoDB is not connected.
zh_hans: MongoDB 未连接。

# PostgreSQL 响应超时，连接已断开。写入可能已完成，请重新连接并核对数据，勿直接重复提交。
source: PostgreSQL timed out and disconnected. The write may have completed. Reconnect and check your data before submitting again.
zh_hans: PostgreSQL 响应超时，连接已断开。写入可能已完成，请重新连接并核对数据，勿直接重复提交。

# PostgreSQL 文本字段不能包含 NUL 字符。
source: PostgreSQL text fields cannot contain NUL characters.
zh_hans: PostgreSQL 文本字段不能包含 NUL 字符。

# SQL 数据库未连接。
source: SQL database is not connected.
zh_hans: SQL 数据库未连接。

# SQL 查询
source: SQL Query
zh_hans: SQL 查询

# SQL 编辑器 · ⌘↵ 运行
source: SQL Editor · ⌘↵ to run
zh_hans: SQL 编辑器 · ⌘↵ 运行

# SQL 语句不能包含 NUL 字符。
source: SQL statements cannot contain NUL characters.
zh_hans: SQL 语句不能包含 NUL 字符。

# SQLite 需要在同一文件夹读写 WAL、SHM 和事务日志。请授权数据库所在文件夹：%@
source: SQLite needs access to WAL, SHM, and transaction journals in the same folder. Allow access to the database folder: %@
zh_hans: SQLite 需要在同一文件夹读写 WAL、SHM 和事务日志。请授权数据库所在文件夹：%@

# Shell 初始化失败
source: Shell initialization failed
zh_hans: Shell 初始化失败

# Shell 命令失败
source: Shell command failed
zh_hans: Shell 命令失败

# Shell 尚未连接。
source: Shell is not connected.
zh_hans: Shell 尚未连接。

# Shell 已停止
source: Shell stopped
zh_hans: Shell 已停止

# Shell 已停止；已执行的写入不会自动撤销。
source: Shell stopped. Completed writes are not automatically undone.
zh_hans: Shell 已停止；已执行的写入不会自动撤销。

# Shell 执行完成
source: Shell execution complete
zh_hans: Shell 执行完成

# Shell 执行进程已退出，下次运行将重新连接。
source: The shell process exited. It will reconnect on the next run.
zh_hans: Shell 执行进程已退出，下次运行将重新连接。

# Shell 正在运行。
source: Shell is running.
zh_hans: Shell 正在运行。

# Shell 资源缺失，请重新构建应用。
source: Shell resources are missing. Rebuild the app.
zh_hans: Shell 资源缺失，请重新构建应用。

# Shell 输出过大，执行已停止；请缩小查询范围。
source: Shell output is too large. Execution stopped. Narrow your query.
zh_hans: Shell 输出过大，执行已停止；请缩小查询范围。

# Shell 运行中…
source: Shell running…
zh_hans: Shell 运行中…

# Shell 运行超时，执行进程已结束。写入可能已完成，请刷新数据确认。
source: Shell timed out and the process ended. Writes may have completed. Refresh to check your data.
zh_hans: Shell 运行超时，执行进程已结束。写入可能已完成，请刷新数据确认。

# Shell 连接失败。
source: Shell connection failed.
zh_hans: Shell 连接失败。

source: TableViewer Mongo Shell · JavaScriptCore + Native Drivers show dbs / show collections / use <database> / it / help db.collection.find({}).sort({name:1}).limit(20) db.collection.findOne({}) / countDocuments({}) / aggregate([...]) db.collection.insertOne({...}) / insertMany([...]) db.collection.updateOne({...}, {$set:{...}}) / updateMany(...) db.collection.deleteOne({...}) / deleteMany(...) / getIndexes() db.runCommand({...}) / db.adminCommand({...}) rs.status() / rs.conf() / db.hello() ObjectId("...") / ISODate("...") / NumberLong("...") / NumberDecimal("...") Supports JavaScript variables, expressions, and print(). No Node.js, filesystem, network, or npm modules. Queries return up to 1,000 records, displayed 20 at a time. Enter it to continue. Press Enter to run; running scripts can be stopped. Write commands execute directly. Stopping or timing out does not undo completed database writes.
zh_hans: TableViewer Mongo Shell · JavaScriptCore + 原生驱动 show dbs / show collections / use <database> / it / help db.collection.find({}).sort({name:1}).limit(20) db.collection.findOne({}) / countDocuments({}) / aggregate([...]) db.collection.insertOne({...}) / insertMany([...]) db.collection.updateOne({...}, {$set:{...}}) / updateMany(...) db.collection.deleteOne({...}) / deleteMany(...) / getIndexes() db.runCommand({...}) / db.adminCommand({...}) rs.status() / rs.conf() / db.hello() ObjectId("...") / ISODate("...") / NumberLong("...") / NumberDecimal("...") 支持 JavaScript 变量、表达式与 print()。不提供 Node.js、文件系统、网络或 npm 模块。 查询默认最多 1,000 条，每批显示 20 条，输入 it 继续。Ctrl+Enter 运行；运行中的脚本可以停止。 写入命令直接执行。停止或超时不会撤销已经完成的数据库写入。

# macOS 钥匙串
source: macOS Keychain
zh_hans: macOS 钥匙串

# use 后需要数据库名称。
source: A database name is required after use.
zh_hans: use 后需要数据库名称。

# ↵ 运行 · ⇧↵ 换行 · ↑↓ 历史
source: ↵ Run · ⇧↵ New line · ↑↓ History
zh_hans: ↵ 运行 · ⇧↵ 换行 · ↑↓ 历史

# 一个懂数据库的搭档。
source: A partner for your database.
zh_hans: 一个懂数据库的搭档。

# 一条 SQL，或命令名位于首位的 MongoDB JSON 命令
source: One SQL statement, or a MongoDB JSON command with the command name first
zh_hans: 一条 SQL，或命令名位于首位的 MongoDB JSON 命令

# 不支持模型提出的工具：%@
source: Unsupported tool proposed by the model: %@
zh_hans: 不支持模型提出的工具：%@

# 不支持的操作
source: Unsupported operation
zh_hans: 不支持的操作

# 专注于%@
source: Focus on %@
zh_hans: 专注于%@

# 为下一个灵感，打开数据的入口。
source: Open a connection and start exploring.
zh_hans: 为下一个灵感，打开数据的入口。

# 主机
source: Host
zh_hans: 主机

# 主键
source: Primary Key
zh_hans: 主键

# 仅移除保存的连接与凭据，数据库文件和数据会保留。
source: Only the saved connection and credentials will be removed. Database files and data will be kept.
zh_hans: 仅移除保存的连接与凭据，数据库文件和数据会保留。

# 从一个好问题开始
source: Start with a question
zh_hans: 从一个好问题开始

# 优先使用 TLS
source: Prefer TLS
zh_hans: 优先使用 TLS

# 你
source: You
zh_hans: 你

# 你的数据，一目了然。
source: Your data, at a glance.
zh_hans: 你的数据，一目了然。

# 例如：我的项目
source: e.g. My Project
zh_hans: 例如：我的项目

# 保存
source: Save
zh_hans: 保存

# 保存中…
source: Saving…
zh_hans: 保存中…

# 保存并连接
source: Save & Connect
zh_hans: 保存并连接

# 保存记录
source: Save Record
zh_hans: 保存记录

# 保存配置
source: Save Configuration
zh_hans: 保存配置

# 修改已保存
source: Changes saved
zh_hans: 修改已保存

# 修改已保存，但刷新失败；请勿重复提交
source: Changes saved, but refresh failed. Do not submit again
zh_hans: 修改已保存，但刷新失败；请勿重复提交

# 停止
source: Stop
zh_hans: 停止

# 健康
source: Health
zh_hans: 健康

# 允许可信内网的明文 HTTP
source: Allow unencrypted HTTP on a trusted private network
zh_hans: 允许可信内网的明文 HTTP

# 内容
source: Content
zh_hans: 内容

# 写一个分页查询
source: Write a paginated query
zh_hans: 写一个分页查询

# 写下查询，按 ⌘↵，让数据给出答案。
source: Write a query and press ⌘↵ to explore your data.
zh_hans: 写下查询，按 ⌘↵，让数据给出答案。

# 写入
source: Write Access
zh_hans: 写入

# 准备就绪
source: Ready
zh_hans: 准备就绪

# 凭据仅保存在钥匙串
source: Credentials stay in Keychain
zh_hans: 凭据仅保存在钥匙串

# 凭据存储
source: Credential Storage
zh_hans: 凭据存储

# 分片路由
source: Sharded Router
zh_hans: 分片路由

# 删除记录
source: Delete Record
zh_hans: 删除记录

# 删除这条记录？
source: Delete this record?
zh_hans: 删除这条记录？

# 刷新
source: Refresh
zh_hans: 刷新

# 刷新 ⌘R
source: Refresh ⌘R
zh_hans: 刷新 ⌘R

# 刷新以查看当前 MongoDB 连接的拓扑。
source: Refresh to see the topology of the current MongoDB connection.
zh_hans: 刷新以查看当前 MongoDB 连接的拓扑。

# 刷新失败，以上为上次快照：%@
source: Refresh failed. Showing the previous snapshot: %@
zh_hans: 刷新失败，以上为上次快照：%@

# 刷新数据
source: Refresh Data
zh_hans: 刷新数据

# 副本集
source: Replica Set
zh_hans: 副本集

# 副本集原始状态
source: Raw Replica Set Status
zh_hans: 副本集原始状态

# 副本集视图仅适用于 MongoDB。
source: The replica set view is available only for MongoDB.
zh_hans: 副本集视图仅适用于 MongoDB。

# 勾选要填写的字段，未勾选的字段使用数据库默认值。
source: Select the fields you want to enter. Unselected fields use database defaults.
zh_hans: 勾选要填写的字段，未勾选的字段使用数据库默认值。

# 包含点号或以 $ 开头的字段请使用 MongoDB 命令编辑。
source: Use MongoDB commands to edit fields containing dots or starting with $.
zh_hans: 包含点号或以 $ 开头的字段请使用 MongoDB 命令编辑。

# 原始状态
source: Raw Status
zh_hans: 原始状态

# 及当前表结构
source: and the current schema
zh_hans: 及当前表结构

# 发送
source: Send
zh_hans: 发送

# 发送内容包含对话历史%@；不会自动发送记录、密码或连接 URI。
source: Sent content includes conversation history %@. Records, passwords, and connection URIs are never sent automatically.
zh_hans: 发送内容包含对话历史%@；不会自动发送记录、密码或连接 URI。

# 发送结果并继续
source: Send Results & Continue
zh_hans: 发送结果并继续

# 取消
source: Cancel
zh_hans: 取消

# 取消退出
source: Cancel Quit
zh_hans: 取消退出

# 只读 · 视图或无主键的表
source: Read-only · View or table without a primary key
zh_hans: 只读 · 视图或无主键的表

# 可编辑
source: Editable
zh_hans: 可编辑

# 同步来源
source: Sync Source
zh_hans: 同步来源

# 响应此请求的节点
source: Node responding to this request
zh_hans: 响应此请求的节点

# 在线
source: Online
zh_hans: 在线

# 复制延迟
source: Replication Lag
zh_hans: 复制延迟

# 外观
source: Appearance
zh_hans: 外观

# 多数派票数
source: Majority Votes
zh_hans: 多数派票数

# 好
source: OK
zh_hans: 好

# 字段
source: Field
zh_hans: 字段

# 字段 %@
source: Field %@
zh_hans: 字段 %@

# 字段、类型和编辑选项会显示在这里。
source: Fields, types, and editing options appear here.
zh_hans: 字段、类型和编辑选项会显示在这里。

# 完成
source: Done
zh_hans: 完成

# 密码
source: Password
zh_hans: 密码

# 导出
source: Export
zh_hans: 导出

# 导出当前结果…
source: Export Current Results…
zh_hans: 导出当前结果…

# 将从 %@ 中永久删除这条记录，此操作无法撤销。
source: This record will be permanently deleted from %@. This cannot be undone.
zh_hans: 将从 %@ 中永久删除这条记录，此操作无法撤销。

# 尚无副本集状态
source: No replica set status
zh_hans: 尚无副本集状态

# 尚未选择
source: Not selected
zh_hans: 尚未选择

# 尚未配置 API
source: API not configured
zh_hans: 尚未配置 API

# 工作台
source: Workspace
zh_hans: 工作台

# 工具调用缺少 query。
source: Tool call is missing query.
zh_hans: 工具调用缺少 query。

# 已修改
source: Modified
zh_hans: 已修改

# 已停止生成。
source: Generation stopped.
zh_hans: 已停止生成。

# 已停止生成，未执行新的数据库操作。
source: Generation stopped. No new database operation was executed.
zh_hans: 已停止生成，未执行新的数据库操作。

# 已刷新
source: Refreshed
zh_hans: 已刷新

# 已发现成员
source: Discovered Members
zh_hans: 已发现成员

# 已发送的工具结果
source: Sent Tool Results
zh_hans: 已发送的工具结果

# 已导出当前结果 · %lld 行
source: Current results exported · %lld rows
zh_hans: 已导出当前结果 · %lld 行

# 已读取拓扑，但无法读取成员状态：%@。健康状态和复制延迟暂不可用。
source: Topology loaded, but member status could not be read: %@. Health and replication lag are unavailable.
zh_hans: 已读取拓扑，但无法读取成员状态：%@。健康状态和复制延迟暂不可用。

# 已连接
source: Connected
zh_hans: 已连接

# 已连接 · 输入 help 查看命令
source: Connected · Enter help for commands
zh_hans: 已连接 · 输入 help 查看命令

# 帮助
source: Help
zh_hans: 帮助

# 帮我了解当前数据库
source: Help me understand this database
zh_hans: 帮我了解当前数据库

# 异常
source: Unhealthy
zh_hans: 异常

# 当前仅显示前 1,000 行或首批文档；请通过 LIMIT / skip 缩小范围。
source: Showing only the first 1,000 rows or the first document batch. Use LIMIT / skip to narrow the range.
zh_hans: 当前仅显示前 1,000 行或首批文档；请通过 LIMIT / skip 缩小范围。

# 当前任期
source: Current Term
zh_hans: 当前任期

# 当前命令不支持，请使用单条 SQL。
source: This command is not supported. Use a single SQL statement.
zh_hans: 当前命令不支持，请使用单条 SQL。

# 当前记录有未保存的修改，请先保存或撤销。
source: This record has unsaved changes. Save or discard them first.
zh_hans: 当前记录有未保存的修改，请先保存或撤销。

# 当前记录有未保存的修改，退出会丢失这些修改。请取消退出后保存或撤销。
source: This record has unsaved changes. Quitting will lose them. Cancel, then save or discard your changes.
zh_hans: 当前记录有未保存的修改，退出会丢失这些修改。请取消退出后保存或撤销。

# 当前连接未报告副本集。独立实例或 mongos 不提供成员复制状态。
source: This connection did not report a replica set. Standalone instances and mongos do not provide member replication status.
zh_hans: 当前连接未报告副本集。独立实例或 mongos 不提供成员复制状态。

# 当前页文档字段
source: Fields in Current Page
zh_hans: 当前页文档字段

# 执行已确认的 Agent 操作…
source: Executing the approved AI operation…
zh_hans: 执行已确认的 Agent 操作…

# 执行成功
source: Query succeeded
zh_hans: 执行成功

# 执行数据库查询
source: Execute Database Query
zh_hans: 执行数据库查询

# 执行查询…
source: Running query…
zh_hans: 执行查询…

# 拒绝
source: Reject
zh_hans: 拒绝

# 拓扑与复制状态
source: Topology & Replication
zh_hans: 拓扑与复制状态

# 授权文件夹
source: Allow Folder Access
zh_hans: 授权文件夹

# 描述你想完成的事情…
source: Describe what you want to do…
zh_hans: 描述你想完成的事情…

# 提出一条 SQL 或 MongoDB JSON 命令，由用户确认后执行；结果只有用户选择发送后才返回模型。
source: Propose one SQL statement or MongoDB JSON command for user approval. Results return to the model only when the user chooses to share them.
zh_hans: 提出一条 SQL 或 MongoDB JSON 命令，由用户确认后执行；结果只有用户选择发送后才返回模型。

# 撤销
source: Discard
zh_hans: 撤销

# 操作失败：
source: Operation failed:
zh_hans: 操作失败：

# 操作完成 · 结果仅保留在本机，待你选择是否发送
source: Operation complete · Results stay local until you choose to share them
zh_hans: 操作完成 · 结果仅保留在本机，待你选择是否发送

# 操作未完成
source: Operation failed
zh_hans: 操作未完成

# 支持 mongodb:// 和 mongodb+srv://；认证、TLS 与副本集选项可写入 URI。
source: Supports mongodb:// and mongodb+srv://. Include authentication, TLS, and replica-set options in the URI.
zh_hans: 支持 mongodb:// 和 mongodb+srv://；认证、TLS 与副本集选项可写入 URI。

# 数据
source: Data
zh_hans: 数据

# 数据库
source: Database
zh_hans: 数据库

# 数据库操作仍在进行。退出不会撤销已完成的写入；未提交的 SQL 事务会在连接关闭后回滚。
source: A database operation is still running. Quitting does not undo completed writes. Uncommitted SQL transactions roll back when the connection closes.
zh_hans: 数据库操作仍在进行。退出不会撤销已完成的写入；未提交的 SQL 事务会在连接关闭后回滚。

# 数据库文件
source: Database File
zh_hans: 数据库文件

# 数据库记录表格
source: Database records table
zh_hans: 数据库记录表格

# 数据表
source: Table
zh_hans: 数据表

# 数据表与视图
source: Tables & Views
zh_hans: 数据表与视图

# 文件授权已失效，请编辑连接并重新选择 SQLite 文件及所在文件夹。
source: File access has expired. Edit the connection and select the SQLite file and its folder again.
zh_hans: 文件授权已失效，请编辑连接并重新选择 SQLite 文件及所在文件夹。

# 文档没有 _id。
source: The document has no _id.
zh_hans: 文档没有 _id。

# 新对话
source: New Conversation
zh_hans: 新对话

# 新建…
source: New…
zh_hans: 新建…

# 新建连接
source: New Connection
zh_hans: 新建连接

# 新建连接 ⌘N
source: New Connection ⌘N
zh_hans: 新建连接 ⌘N

# 新建连接…
source: New Connection…
zh_hans: 新建连接…

# 无
source: None
zh_hans: 无

# 无主键的表不能直接删除记录。
source: Records cannot be deleted directly from a table without a primary key.
zh_hans: 无主键的表不能直接删除记录。

# 无效的 HTTP 响应。
source: Invalid HTTP response.
zh_hans: 无效的 HTTP 响应。

# 无法保存文件授权：
source: Unable to save file access:
zh_hans: 无法保存文件授权：

# 无法创建 JavaScript 执行环境。
source: Unable to create a JavaScript context.
zh_hans: 无法创建 JavaScript 执行环境。

# 无法创建 SQLite 文件。
source: Unable to create the SQLite file.
zh_hans: 无法创建 SQLite 文件。

# 无法创建 Shell 连接。
source: Unable to create a shell connection.
zh_hans: 无法创建 Shell 连接。

# 无法创建示例数据库。
source: Unable to create the sample database.
zh_hans: 无法创建示例数据库。

# 无法初始化 SQLite 文件。
source: Unable to initialize the SQLite file.
zh_hans: 无法初始化 SQLite 文件。

# 无法将连接凭据存入钥匙串（%d）。
source: Unable to store connection credentials in Keychain (%d).
zh_hans: 无法将连接凭据存入钥匙串（%d）。

# 无法打开 SQLite 数据库。
source: Unable to open the SQLite database.
zh_hans: 无法打开 SQLite 数据库。

# 无法访问 SQLite 文件或日志，请检查文件及所在文件夹的授权，并在编辑连接中重新选择。
source: Unable to access the SQLite file or journals. Check access to the file and its folder, then select them again in Edit Connection.
zh_hans: 无法访问 SQLite 文件或日志，请检查文件及所在文件夹的授权，并在编辑连接中重新选择。

# 无法读取钥匙串凭据（%d）。
source: Unable to read Keychain credentials (%d).
zh_hans: 无法读取钥匙串凭据（%d）。

# 无法连接 PostgreSQL。
source: Unable to connect to PostgreSQL.
zh_hans: 无法连接 PostgreSQL。

# 是
source: Yes
zh_hans: 是

# 显示 URI
source: Show URI
zh_hans: 显示 URI

# 显示记录详情
source: Show Record Details
zh_hans: 显示记录详情

# 更新于 %@ · 延迟基于响应节点的心跳快照
source: Updated %@ · Lag is based on the responding node's heartbeat snapshot
zh_hans: 更新于 %@ · 延迟基于响应节点的心跳快照

# 有未保存的修改
source: Unsaved changes
zh_hans: 有未保存的修改

# 未知
source: Unknown
zh_hans: 未知

# 未知节点
source: Unknown node
zh_hans: 未知节点

# 未连接。
source: Not connected.
zh_hans: 未连接。

# 本地 · 示例数据库
source: Local · Sample database
zh_hans: 本地 · 示例数据库

# 本地文件
source: Local file
zh_hans: 本地文件

# 本地服务可留空
source: Optional for local services
zh_hans: 本地服务可留空

# 本地示例
source: Local sample
zh_hans: 本地示例

# 本地示例 · 可自由编辑
source: Local sample · Freely editable
zh_hans: 本地示例 · 可自由编辑

# 本次连接的查询历史
source: Query history for this connection
zh_hans: 本次连接的查询历史

# 本次连接还没有查询记录
source: No queries in this connection yet
zh_hans: 本次连接还没有查询记录

# 查找表或集合
source: Find a table or collection
zh_hans: 查找表或集合

# 查看本地结果（尚未发送）
source: View Local Results (Not Sent)
zh_hans: 查看本地结果（尚未发送）

# 查看错误（尚未发送）
source: View Error (Not Sent)
zh_hans: 查看错误（尚未发送）

# 查询
source: Query
zh_hans: 查询

# 查询代码编辑器
source: Query code editor
zh_hans: 查询代码编辑器

# 查询完成 · %lld 行受影响
source: Query complete · %lld rows affected
zh_hans: 查询完成 · %lld 行受影响

# 查询将直接在这个连接上执行，写入语句会修改数据。
source: This query runs directly on this connection. Write statements will modify data.
zh_hans: 查询将直接在这个连接上执行，写入语句会修改数据。

# 查询工作台
source: Query Workspace
zh_hans: 查询工作台

# 查询结果
source: Query Results
zh_hans: 查询结果

# 查询编辑器
source: Query Editor
zh_hans: 查询编辑器

# 查询编辑器不支持 COPY，连接已断开；未提交事务会回滚。导出数据请使用 CSV 导出。
source: COPY is not supported in the query editor. The connection was closed; uncommitted transactions will roll back. Use CSV export to export data.
zh_hans: 查询编辑器不支持 COPY，连接已断开；未提交事务会回滚。导出数据请使用 CSV 导出。

# 检查数据库结构
source: Inspect Database Schema
zh_hans: 检查数据库结构

# 检查索引使用情况
source: Check index usage
zh_hans: 检查索引使用情况

# 模型
source: Model
zh_hans: 模型

# 模型 ID
source: Model ID
zh_hans: 模型 ID

# 模型没有返回内容或工具调用。
source: The model returned no content or tool calls.
zh_hans: 模型没有返回内容或工具调用。

# 模型输出达到上限，请缩小请求范围后重试；未执行任何工具。
source: The model reached its output limit. Narrow the request and try again. No tools were executed.
zh_hans: 模型输出达到上限，请缩小请求范围后重试；未执行任何工具。

# 正在连接…
source: Connecting…
zh_hans: 正在连接…

# 每 10 秒刷新
source: Refresh every 10 seconds
zh_hans: 每 10 秒刷新

# 每次执行一条 SQL · 修改语句会直接写入数据库
source: One SQL statement at a time · Write statements modify the database directly
zh_hans: 每次执行一条 SQL · 修改语句会直接写入数据库

# 每次运行一条 SQL 语句；请分别运行多条语句。
source: Run one SQL statement at a time. Execute multiple statements separately.
zh_hans: 每次运行一条 SQL 语句；请分别运行多条语句。

# 每页 200 条
source: 200 per page
zh_hans: 每页 200 条

# 每页记录
source: Records per Page
zh_hans: 每页记录

# 没有主键的表请使用查询编辑器修改。
source: Use the query editor to modify tables without a primary key.
zh_hans: 没有主键的表请使用查询编辑器修改。

# 没有匹配的记录
source: No matching records
zh_hans: 没有匹配的记录

# 流式显示回复
source: Stream responses
zh_hans: 流式显示回复

# 流式连接提前结束，请重试；未执行任何工具。
source: The stream ended early. Try again. No tools were executed.
zh_hans: 流式连接提前结束，请重试；未执行任何工具。

# 浅色
source: Light
zh_hans: 浅色

# 测试并获取模型
source: Test & Load Models
zh_hans: 测试并获取模型

# 测试连接
source: Test Connection
zh_hans: 测试连接

# 深色
source: Dark
zh_hans: 深色

# 添加一条记录，或在查询工作台中开始探索。
source: Add a record, or explore in the query workspace.
zh_hans: 添加一条记录，或在查询工作台中开始探索。

# 添加记录
source: Add Record
zh_hans: 添加记录

# 清屏
source: Clear
zh_hans: 清屏

# 版本
source: Version
zh_hans: 版本

# 独立实例
source: Standalone
zh_hans: 独立实例

# 用户名
source: Username
zh_hans: 用户名

# 用户拒绝执行。
source: The user rejected execution.
zh_hans: 用户拒绝执行。

# 用户拒绝此操作。未执行查询。
source: The user rejected this operation. No query was executed.
zh_hans: 用户拒绝此操作。未执行查询。

# 确认执行一次
source: Approve & Run Once
zh_hans: 确认执行一次

# 禁用（仅受信任本地网络）
source: Disable (trusted local networks only)
zh_hans: 禁用（仅受信任本地网络）

# 移除连接
source: Remove Connection
zh_hans: 移除连接

# 移除连接？
source: Remove connection?
zh_hans: 移除连接？

# 端口
source: Port
zh_hans: 端口

# 第 %lld 页
source: Page %lld
zh_hans: 第 %lld 页

# 筛选当前页
source: Filter current page
zh_hans: 筛选当前页

# 筛选当前页…
source: Filter current page…
zh_hans: 筛选当前页…

# 类型
source: Type
zh_hans: 类型

# 终端
source: Shell
zh_hans: 终端

# 结构
source: Structure
zh_hans: 结构

# 结果显示失败
source: Unable to display the result
zh_hans: 结果显示失败

# 结果目前只在本机。确认后会将上面的工具结果发送给所配置的 API。
source: Results are currently local. Confirm to send the tool results above to your configured API.
zh_hans: 结果目前只在本机。确认后会将上面的工具结果发送给所配置的 API。

# 编辑后按 ⌘S 保存
source: Press ⌘S to save your edits
zh_hans: 编辑后按 ⌘S 保存

# 编辑文档时不能修改 _id。
source: The _id cannot be changed when editing a document.
zh_hans: 编辑文档时不能修改 _id。

# 编辑连接
source: Edit Connection
zh_hans: 编辑连接

# 编辑连接…
source: Edit Connection…
zh_hans: 编辑连接…

# 缺少 MongoDB 命令名称。
source: Missing MongoDB command name.
zh_hans: 缺少 MongoDB 命令名称。

# 缺少原始文档。
source: Missing original document.
zh_hans: 缺少原始文档。

# 缺少连接参数。
source: Missing connection parameters.
zh_hans: 缺少连接参数。

# 自动生成
source: Generated
zh_hans: 自动生成

# 节点
source: Node
zh_hans: 节点

# 表/集合：%@ 当前对象：%@ 字段：
source: Tables/collections: %@ Current object: %@ Fields:
zh_hans: 表/集合：%@ 当前对象：%@ 字段：

# 表结构
source: Table Structure
zh_hans: 表结构

# 要求加密
source: Require Encryption
zh_hans: 要求加密

# 视图
source: View
zh_hans: 视图

# 角色
source: Role
zh_hans: 角色

# 解释结构、编写查询、一起排查问题。每一步数据库操作，都会先交给你确认。
source: Understand schemas, write queries, and investigate issues. Every database operation needs your approval.
zh_hans: 解释结构、编写查询、一起排查问题。每一步数据库操作，都会先交给你确认。

# 让数据回应你的每一行。
source: Let your data answer every line.
zh_hans: 让数据回应你的每一行。

# 记录
source: Record
zh_hans: 记录

# 记录字段已变化，请刷新后重试。
source: Record fields have changed. Refresh and try again.
zh_hans: 记录字段已变化，请刷新后重试。

# 记录已删除
source: Record deleted
zh_hans: 记录已删除

# 记录已删除，但刷新失败
source: Record deleted, but refresh failed
zh_hans: 记录已删除，但刷新失败

# 记录已变更、删除或不唯一；本次修改已撤销，请刷新。
source: The record changed, was deleted, or is not unique. This change was rolled back. Refresh your data.
zh_hans: 记录已变更、删除或不唯一；本次修改已撤销，请刷新。

# 记录已变更或删除，请刷新后重试。
source: The record changed or was deleted. Refresh and try again.
zh_hans: 记录已变更或删除，请刷新后重试。

# 记录已添加
source: Record added
zh_hans: 记录已添加

# 记录已添加，但刷新失败；请勿重复提交
source: Record added, but refresh failed. Do not submit again
zh_hans: 记录已添加，但刷新失败；请勿重复提交

# 记录已被删除，请刷新。
source: The record was already deleted. Refresh your data.
zh_hans: 记录已被删除，请刷新。

# 记录详情
source: Record Details
zh_hans: 记录详情

# 设置
source: Settings
zh_hans: 设置

# 试试其他关键词；筛选仅作用于当前页。
source: Try another keyword. Filtering applies only to the current page.
zh_hans: 试试其他关键词；筛选仅作用于当前页。

# 语言 / Language
source: Language
zh_hans: 语言 / Language

# 语言设置将在下次启动时生效。请先保存修改，再退出并重新打开应用。
source: The language change takes effect on next launch. Save your changes, then quit and reopen the app.
zh_hans: 语言设置将在下次启动时生效。请先保存修改，再退出并重新打开应用。

# 说明目的和可能的写入影响
source: Explain the purpose and possible write effects
zh_hans: 说明目的和可能的写入影响

# 请先保存或撤销当前记录的修改。
source: Save or discard changes to the current record first.
zh_hans: 请先保存或撤销当前记录的修改。

# 请先设置模型名称。
source: Set a model name first.
zh_hans: 请先设置模型名称。
